//! =============================================== !//
//! ===========    СODEWARS ADVANCED    =========== !//
//! =============================================== !//

//!   7 kyu https://www.codewars.com/kata/count-strings-in-objects
//?   Создайте функцию strCount (принимает объект в качестве аргумента), которая будет подсчитывать все строковые значения внутри объекта.

function strCount(obj) {

}


//!   6 kyu https://www.codewars.com/kata/base-conversion
//?   В этом ката вы должны реализовать базовый преобразователь, который преобразует
//?   положительные целые числа между произвольными базами/алфавитами. Вот несколько предопределенных алфавитов:

//!   6 kyu https://www.codewars.com/kata/bingo-card
//?   После очередного спора об их игре Ассоциация Бинго решает изменить курс и автоматизировать игру.
//?   Можете ли вы помочь ассоциации, написав метод для создания случайной карты Бинго?


//!   6 kyu https://www.codewars.com/kata/bit-counting
//?   Напишите функцию, которая принимает целое число в качестве входных данных и возвращает количество битов,
//?   равных единице в двоичном представлении этого числа. Вы можете гарантировать, что ввод неотрицательный.
//?   Пример : двоичное представление 1234is , поэтому в этом случае 10011010010функция должна вернуться5

//!   6 kyu https://www.codewars.com/kata/clocky-mc-clock-face
//?   Из-за отсутствия обслуживания минутная стрелка отвалилась от циферблата ратуши.
//?   И поскольку местный совет потерял большую часть наших налоговых денег из-за нигерийской аферы с электронной почтой,
//?   у него нет средств, чтобы правильно починить часы.
//?   Вместо этого они просят программистов-добровольцев написать код, который определяет время, просто взглянув на оставшуюся часовую стрелку!

//!   6 kyu https://www.codewars.com/kata/is-a-number-prime
//?   Определите функцию, которая принимает целочисленный аргумент и
//?   возвращает логическое значение trueили falseв зависимости от того, является ли целое число простым.
//?   Согласно Википедии, простое число (или простое число) — это натуральное число, большее,
//?   чем 1не имеющее положительных делителей, кроме 1самого себя.

//!   6 kyu https://www.codewars.com/kata/lottery-ticket

//!   6 kyu https://www.codewars.com/kata/weird-string-case

//!   6 kyu https://www.codewars.com/kata/who-likes-it

//!   5 kyu https://www.codewars.com/kata/rgb-to-hex-conversion
